Repository: UrCatIsWatcinU/Polygons
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Remember Me
ru: Запомнить меня

source: Submit
ru: Войти

source: Repeat password
ru: Повторите пароль

source: Register
ru: Регистрация

source: Username is used
ru: Имя пользователя занято

source: Email is used
ru: E-mail используется

source: If you write URL manually, check if it is correct
ru: Если Вы набрали ссылку вручную, проверьте её правильность

source: Some troubles happend on server. Please send message to admin
ru: На сервере произошла ошибка, пожалуйста, напишите администратору

source: Verification required
ru: Требуется подтверждение e-mail адреса

source: An email with a link to confirm your email address has been sent to your email address. If you have not received the email, please contact the site administrator.
ru: На Ваш адрес электронной почты было отправлено электронное письмо со ссылкой для подтверждения Вашего адреса электронной почты. Если Вы не получили электронное письмо, пожалуйста, свяжитесь с администратором сайта.

source: Access denied
ru: Доступ запрещен

source: No such user
ru: Нет такого пользователя

source: This user alredy is a member of this chat
ru: Пользователь уже состоит в этом чате

source: No such hexagon
ru: Нет такого шестиугольника

source: Back
ru: Назад

source: Open chat with admin
ru: Открыть чат с админом

source: Search
ru: Поиск

source: Settings
ru: Настройки

source: Main
ru: Главная

source: Hexagons
ru: Шестиугольники

source: Creation
ru: Создание

source: To create *hexagon* use [contextmenu] > [create] (in desktop you can open it with right mouse button, on touch devices with long tap).Only registered users can create hexagons and make other changes to the system, which are described below
ru: Для создания *шестиугольника* используйте [контекстное&nbsp;меню] > [создать] (на ПК Вы можете открыть его правой кнопкой мыши, на сенсорных устройствах - долгим нажатием). Только зарегистрированные пользователи могут создавать шестиугольники и вносить другие изменения в систему

source: *Chains* are built from hexagons, and when you create a hexagon separately from any chain, it creates a new chain. You can create an unlimited number of chains and an unlimited number of hexagons in each of your chains
ru: *Цепочки* строятся из шестиугольников, и когда Вы создаете шестиугольник отдельно от любой цепочки, создается новая. Вы можете создать неограниченное количество цепочек и неограниченное количество шестиугольников в каждой из Ваших цепочек

source: But there are a few limitations
ru: Но есть несколько ограничений

source: you can't continue other people's chains
ru: Вы не можете продолжать цепочки других людей

source: the chains must not intersect
ru: цепочки не должны пересекаться

source: the category size is limited for performance reasons
ru: размер категории ограничен по соображениям производительности

source: So if you see {red:[not here]} in context menu, you need to choose another place to create hex
ru: Поэтому, если Вы видите {red:[не&nbsp;здесь]} в контекстном меню, вам нужно выбрать другое место для создания шестиугольника

source: Admins can continue other people's chains and do other actions with artefacts in the system like owners on this artefacts
ru: Администратор может продолжать цепочки других людей и выполнять другие действия с артефактами в системе, как если бы он был владельцем этих артефактов

source: Deletion and other actions
ru: Удаление и другие действия

source: All actions with hexagon you can do using [contextmenu], when right click or open it with a long press on the *hexagon*. There are short description for each action you can do
ru: Все действия с шестиугольником Вы можете выполнить с помощью [меню], щелкнув правой кнопкой мыши или открыв его долгим нажатием на *шестиугольник*. Краткое описание для каждого действия:

source: The information below
ru: Информация ниже

source: Only creator
ru: Создатель

source: You can find help in
ru: Вы можете найти помощь в

source: Updations
ru: Редактирование

source: When you click this button, a page opens with your chats and you can send the hexagon as an attachment.
ru: Когда Вы нажимаете эту кнопку, открывается страница с Вашими чатами, и Вы можете отправить шестиугольник в качестве вложения.

source: More here
ru: Подробнее здесь

source: All hexs in the system have unique link and you can share some materials from Library Hexagon using this option
ru: Все шестиугольники в системе имеют уникальную ссылку, и Вы можете поделиться некоторыми материалами из Library Hexagon, скопировав её

source: The administration monitors the content in the system, and if you think that some hexagon is violating anything, please let us know using this button
ru: Администрация следит за контентом в системе, и если Вы считаете, что какой-то шестиугольник что-либо нарушает, пожалуйста, сообщите нам об этом с помощью этой кнопки

source: So, about deletions. *When you delete one hexagon, the others in the chain behind it are also deleted*. This is necessary so that the structure and logic of the chains are not violated. By analogy with the creation of the first hexagon when you delete it, the entire chain along with all the content and comments in it will also be deleted
ru: Итак, об удалении. *Когда Вы удаляете один шестиугольник, остальные в цепочке за ним также удаляются*. Это необходимо для того, чтобы не нарушалась структура и логика цепочек. По аналогии с созданием первогошестиугольника, когда вы удаляете первый шестиугольник удаляется вся цепочка вместе со всем контентом и комментариями в ней

source: Updations and images
ru: Редактирование и изображения

source: When you create the hexagon, you need to paste some *key word* or *drop image* into it, otherwise, it will be deleted after 30 minutes
ru: Когда Вы создаете шестиугольник, Вам нужно вставить в него какое-нибудь ключевое слово или изображение, в противном случае он будет удален через 30 минут

source: Paste text
ru: Вставка текста

source: To insert text, quickly click on the hexagon twice, as you would to open a folder on your computer. You can also use the button
ru: Чтобы вставить текст, быстро нажмите на шестиугольник дважды, как если бы Вы открывали папку на своем компьютере. Вы также можете использовать кнопку

source: The maximum number of words in the hexagon is determined by the admin for each category, usually this is *from 5 to 8 words*
ru: Максимальное количество слов в шестиугольнике определяется администратором для каждой категории, обычно это *от 5 до 8 слов*

source: Drop image
ru: Вставка изображения

source: Use classical drag-n-drop motions: open folder with file, then drag it into the hexagon. There are some restrictions for file
ru: Используйте классические движения перетаскивания: откройте папку с файлом, затем перетащите файл из нее в шестиугольник. Существуют некоторые ограничения для файлов

source: You need to drop *only one file*
ru: Вы должны перетащить только один файл

source: We *do not support* big files, so max file size is
ru: Мы *не поддерживаем* большие файлы, поэтому максимальный размер файла -

source: You can drop only file with extension from this list
ru: Мы поддерживаем файлы только с расширением из этого списка

source: About pages
ru: Странички контента

source: Content and editor
ru: Контент и редактор

source: There is your place to create arcicles or notes.
ru: На этой вкладке странички Вы можете создавать статьи или заметки, которыми хотите поделиться с другими пользователями.

source: For start typing open [About page] by clicking on the text in the hexagon and select [Content] tab (selected by default) in the opened page. Then quickly click on this page how to paste text in the hexagon, or [contextmenu] on page >
ru: Для начала редактирования текста откройте [страничку&nbsp;контента], нажав на текст в шестиугольнике, и выберите вкладку [Контент]. Затем быстро нажмите на эту страничку два раза, как для вставки текста в шестиугольник, или используйте [меню&nbsp;правой&nbsp;кнопки] на страничке >

source: You will see text editor with standart rich text editor functions powered by
ru: Вы увидите текстовый редактор со стандартными функциями rich text editor, основанный на

source: You can edit content only in your own chains
ru: Вы можете редактировать контент только в своих собственных цепочках

source: Comments and rating
ru: Комментарии и рейтинг

source: To leave a comment, switch to the comments tab, enter your comment in the text box, and send it. Comments are shared across the entire chain, as is the rating, which can be seen in the upper-right corner
ru: Чтобы оставить комментарий, перейдите на вкладку [комментарии], введите свой комментарий в текстовое поле и отправьте его. Комментарии относятся ко всей цепочке, как и рейтинг, который можно увидеть в правом верхнем углу

source: You can reply to any comment by clicking on the [three dots] in the upper-right corner of the comment > [reply] or write "[reply /some_username/]" - and your comment will be send to the latest comment by user with /some_username/
ru: Вы можете ответить на любой комментарий, нажав на [три&nbsp;точки] в правом верхнем углу комментария > [ответить] или написать "[reply /some_username/]", тогда Ваш комментарий будет отправлен ответом на последний комментарий пользователя с именем /some_username/

source: *The chain rating* is a number determined by users, indicating the usefulness and literacy of information in the chain. Each user can either add one to the overall rating, or take it away using the [&nbsp+&nbsp] and [&nbsp-&nbsp] buttons
ru: *Рейтинг цепочки* - это число, определяемое пользователями, указывающее на полезность и грамотность информации в цепочке. Каждый пользователь может либо прибавить единицу в общий рейтинг, либо отнять с помощью кнопок [&nbsp+&nbsp] и [&nbsp-&nbsp]

source: In addition to the chains, users also have a rating, and using [dropmenu] (opens if you click to your name in the header) > [User list] you can see top users by rating
ru: У пользователей также как и у цепочек есть рейтинг, и Вы можете посмотреть топ пользователей по рейтингу используя [навигационное&nbsp;меню] > [Пользователи]

source: Community rules
ru: Правила сообщества

source: If you do not comply with our rules, you may be banned
ru: Если Вы не соблюдаете наши правила, Вы можете быть забанены

source: Administration can delete your account or ban your IP-adress, so we recomended to follow our rules
ru: Администрация может удалить Ваш аккаунт или заблокировать IP-адрес, поэтому мы рекомендуем следовать нашим правилам

source: If you think that any hexagon, chain or comment break the rules, report it to one of the admins in the chat or via
ru: Если Вы считаете, что какой-либо шестиугольник, цепочка или комментарий нарушают правила, сообщите об этом одному из администраторов в чате или через кнопку

source: Do not use profanity or offensive words in relation to other users. *Stay cultured people*
ru: Не используйте ненормативную лексику и не оскорбляйте других пользователяей. *Оставайтесь культурными людьми*

source: Make sure that the content you post in Library Hexagon belongs to you or does not infringe on other people's *intellectual property rights*
ru: Убедитесь, что контент, который Вы размещаете в Library Hexagon, принадлежит вам или не нарушает права других людей на *интеллектуальную собственность*

source: The Library Hexagon prohibits the publication of materials containing
ru: В Library Hexagon запрещена публикация материалов, содержащих

source: Sensitive content 18+
ru: Деликатный 18+ контент

source: Violent or dangerous content
ru: Контент, содержащий сцены или описание насилия

source: Promotion of smoking or alcohol
ru: Пропаганду курения или алкоголя

source: Discussion of prohibited goods
ru: Обсуждение запрещенных товаров

source: *Do not spam* other users in chats. If you are being spammed by anyone, please let us know
ru: *Не спамьте* другим пользователям в чатах. Если Вам кто-то спамит, пожалуйста, сообщите нам об этом

source: Messages
ru: Сообщения

source: Chats
ru: Чаты

source: In the Library Hexagon you can communicate internally using inbox messages
ru: В Library Hexagon существует встроенная система сообщений, которая предназначена для обсуждения контента системы

source: At the moment, there is an opportunity
ru: Вы можете

source: to create a chat with several users for *group correspondence*
ru: создать чат с несколькими пользователями для *групповой переписки*

source: In the [dropmenu], click messages and when you see the chat panel in front of you, click [add chat]. In the modal window that appears, enter the name of the chat and the members separated by commas (you can add them later)
ru: В [навигационном&nbsp;меню] выберите пункт [Сообщения], и когда Вы увидите панель чатов, нажмите кнопку [Добавить&nbsp;чат]. В появившемся модальном окне введите имя чата и список участников через запятую (Вы сможете изменить его позже)

source: Or write to one user directly and start a *private chat*
ru: Или напишите пользователю напрямую и начните *приватный чат*

source: On the page of any user (you can get through [dropmenu] > [User list]), click open chat, your messages will open, and if you do not have a chat with this user yet, it will be automatically created
ru: на странице любого пользователя (Вы можете перейти через [навигационное&nbsp;меню] > [Пользователи]) нажмите [открыть&nbsp;чат], откроется страница с Вашими сообщениями, и если у Вас еще нет чата с этим пользователем, он будет создан автоматически

source: Chats are not designed to transmit important or secret information, so be careful and choose other messengers for confidential communication
ru: Чаты не предназначены для передачи важной или секретной информации, поэтому будьте осторожны и выбирайте другие мессенджеры для конфиденциального общения

source: You can *delete* any chat that you have created at any time, but you must remember that all messages in this case will be permanently lost
ru: Вы можете *удалить* любой чат, который Вы создали в любое время, но Вы должны помнить, что все сообщения в этом случае будут безвозвратно потеряны

source: Members and chat control
ru: Управление участниками чата

source: If you are a chat creator, you can manage its members and settings. You can also always quit from any chat.
ru: Если Вы являетесь создателем чата, Вы можете управлять его участниками и настройками. Вы также всегда можете выйти из любого чата.

source: {red:Remember!} If you leave the chat you will not be able to return
ru: {red:Запомните!} Если Вы покинете чат, Вы не сможете вернуться

source: To *add or delete* members in chat you need to open caht info panel by clicking the [&nbspi&nbsp] button in right corner of the chat. In this panel, you will see a list of participants, and if you are the chat admin
ru: Чтобы *добавить или удалить* участника в чата, Вам нужно открыть информационную панель, нажав кнопку [&nbspi&nbsp] в правом углу чата. На этой панели Вы увидите список участников, и если Вы являетесь администратором чата

source: you can *remove* any member by using the [cross] next to the name
ru: Вы можете *удалить* любого участника, используя [крестик] рядом с его именем

source: *add* a member by clicking on the [three dots] in the upper left corner of the panel
ru: *добавить* участника, нажав на [три&nbsp;точки] в правом верхнем углу панели

source: and *change* the role of the member by clicking on the {role:role indicator} to the left of the username
ru: и *изменить* роль участника, нажав на {role:роль} слева от имени пользователя

source: Messages and entities
ru: Сообщения и отправка сущностей

source: In addition to the plain text, chat messages can display various entities or mentions of users using a special syntax or
ru: В дополнение к обычному тексту, сообщения чата могут отображать различные сущности или упоминания пользователей. Вы можете вставить упоминание или сущность в сообщение, используя специальный синтаксис или кнопку

source: About *deleting* messages: You can delete a message by clicking on the [cross] in the upper-right corner of the message. If you are a member, you can only delete your messages, the admin can delete any
ru: Об *удалении* сообщений: Вы можете удалить сообщение, нажав на [крестик] в правом верхнем углу сообщения. Если Вы являетесь участником, Вы можете удалять только свои сообщения, администратор чата может удалять любые

source: Users mentions
ru: Упоминания пользователей

source: You can mention any Library Hexagon user using the standard mentions syntax
ru: Вы можете упомянуть любого пользователя Library Hexagon, используя стандартный синтаксис упоминаний

source: Hexs or chains
ru: Шестиугольники или цепочки

source: When you need to discus any hex or chain from Library Hexagon, you can use such syntax (/some_id/ must be number, /attachment_number/ is serial number of the attachment), or use
ru: Когда Вам нужно обсудить какой-либо шестиугольник или цепочку из Library Hexagon, Вы можете использовать такой синтаксис в сообщении (/some_id/ должен быть номером, /attachment_number/ является порядковым номером вложения) или использовать кнопку

source: Links
ru: Ссылки

source: If you want to paste link, use this syntax
ru: Если Вы хотите вставить ссылку, используйте подобный синтаксис

source: Creations
ru: Создание

source: Deletions
ru: Удаление

source: About page
ru: Страничка контента

source: Content
ru: Контент

source: Comments
ru: Комментарии

source: Rules
ru: Правила

source: Members
ru: Участники

source: Entities
ru: Сущности

source: Help
ru: Справка

source: Users list
ru: Пользователи

source: Profile
ru: Профиль

source: Logout
ru: Выйти

source: Login
ru: Вход в систему

source: Add chat
ru: Добавить чат

source: Select chat
ru: Выберите чат

source: First select one of chats
ru: Сначала выберите чат

source: Send
ru: Отправить

source: Chains count
ru: Количество цепочек

source: Hexs count
ru: Количество шестиугольников

source: Rating
ru: Рейтинг

source: Delete profile
ru: Удалить профиль

source: Open chat
ru: Открыть чат

source: Users
ru: Пользователи

source: Role
ru: Роль

source: Show
ru: Показать

source: Hide
ru: Скрыть

source: me in list
ru: меня в этом списке
